const { Telegraf } = require('telegraf');
require('dotenv').config()
const {Markup} = require("telegraf")
const bot = new Telegraf(process.env.BOT_TOKEN);



bot.start((ctx) => {
    ctx.reply("для начала опредилим вашу остановку :)", {
        reply_markup: {
            inline_keyboard: [
                [
                    { text: "коллективный сад", callback_data: "data1"}, { text: "Окружная", callback_data: "data2"},
                    { text: "берест_литовская", callback_data: "data3"}, { text: "высокая", callback_data: "data4"}
                ],
                [
                    { text: "котовскoго", callback_data: "data5"}, { text: "спортивная", callback_data: "data6"},
                    { text: "баня", callback_data: "data7"}, { text: "мельзавод", callback_data: "data8"}
                ],
                [
                    { text: "площадь революции", callback_data: "data9"}, { text: "почта", callback_data: "data10"},
                    { text: "вокзал", callback_data: "data11"}, { text: "калинина", callback_data: "data12"},
                   
                ], 
                [
                    { text: "чкаловский", callback_data: "data13"},{ text: "лесазавод", callback_data: "data14"},
                    { text: "сму5", callback_data: "data15"},
                    
         
                ],
                [
                    { text: "костромская", callback_data: "data16"},{ text: "балагоева", callback_data: "data17"},
                    { text: "рынок", callback_data: "data18"}, { text: "щорса", callback_data: "data19"},
                ],
                [
                    { text: "сос. бор", callback_data: "data20"},{ text: "рубинского", callback_data: "data21"},
                    { text: "комунальная", callback_data: "data22"}, { text: "грузинская", callback_data: "data23"},
                    
         
                ]  
             
            ]}})
})



bot.help((ctx) =>{ ctx.reply("/st --- вызов меню")})
1

  bot.hears("/st" , (ctx) => {ctx.reply("на какой вы сейчас остановке? :)", {
    reply_markup: {
        inline_keyboard: [
            [
                { text: "коллективный сад", callback_data: "data1"}, { text: "Окружная", callback_data: "data2"},
                { text: "берест_литовская", callback_data: "data3"}, { text: "высокая", callback_data: "data4"}
            ],
            [
                { text: "котовского", callback_data: "data5"}, { text: "спортивная", callback_data: "data6"},
                { text: "баня", callback_data: "data7"}, { text: "мельзавод", callback_data: "data8"}
            ],
            [
                { text: "площадь революции", callback_data: "data9"}, { text: "почта", callback_data: "data10"},
                { text: "вокзал", callback_data: "data11"}, { text: "калинина", callback_data: "data12"},
               
            ], 
            [
                { text: "чкаловский", callback_data: "data13"},{ text: "лесазавод", callback_data: "data14"},
                { text: "сму5", callback_data: "data15"},
                
     
            ],
            [
                { text: "костромская", callback_data: "data16"},{ text: "балагоева", callback_data: "data17"},
                { text: "рынок", callback_data: "data18"}, { text: "щорса", callback_data: "data19"},
            ],
            [
                { text: "сос. бор", callback_data: "data20"},{ text: "рубинского", callback_data: "data21"},
                { text: "комунальная", callback_data: "data22"}, { text: "грузинская", callback_data: "data23"},
                
     
            ],
            [
                { text: "открыть сайт если что - то непонятно", url:'https://www.admkineshma.ru/city/turizm/raspisanie/doc/marshrut-10.php'}
            ]  
            
         
]}})
})


  
   
bot.action('data1', (ctx) => {

})



        bot.action('data1', (ctx) => {
        ctx.reply(
`
маршрут номер 10                                                    
график1               
Коллективный сад     
6-39<-
6-42->
8-04<-
8-06->
9-42<-
9-44->
11-19<-
11-23->
13-44<-
13-48->
15-24<-
15-29->
16-56<-
17-00->
18-31<-
18-35<-
20-05->
20-07<-



маршрут номер 10
график2
Коллективный сад
7-33->
7-36<-
8-56<-
8-58->
10-20<-
10-22->
11-45<-
13-08->
13-10<-
14-43->
14-48<-
16-10->
16-12<-
17-33->
17-37<-
19-01->
19-06<-
20-32->
20-36<-

/st---- вызов меню остановок
`
)
          })

          bot.action('data2', (ctx) => {
            ctx.reply(
`
маршрут номер 10
график1
окружная
6-37
6-44
8-03
8-08
9-40
9-46
11-17
11-24
13-42
13-50
15-22
15-31
16-54
17-02
18-29
18-37
20-03
20-09

маршрут номер 10
график2
окружная
7-31
7-38
8-54
9-00
10-18
10-24
11-43
13-06
13-12
14-41
14-50
16-09
16-14
17-31
17-39
18-59
19-08
20-30
20-38

/st---- вызов меню остановок
`
)
          }) 

          bot.action('data3', (ctx) => {
            ctx.reply( 
            `
маршрут номер 10
график1   
Брест-Литовская
6-35
6-45
8-01
8-10
9-38
9-48
11-15
11-26
13-40
13-52
15-20
15-32
16-52
17-04
18-28
18-39
20-01
20-11

маршрут номер 10
график2
Брест-Литовская
7-29
7-40
8-52
9-02
10-16
10-26
11-41
13-04
13-14
14-39
14-52
16-08
16-15
17-29
17-41
18-57
19-10
20-28
20-40

/st---- вызов меню остановок

            `
            
            )
        })          
        

        bot.action('data4', (ctx) => {
            ctx.reply(
            `
маршрут номер 10
график1
Высокая
6-34
6-47
7-59
8-12
9-36
9-50
11-13
11-28
13-39
13-54
15-18
15-33
16-51
17-05
18-27
18-40
20-00
20-12


маршрут номер 10
график2
Высокая
7-27
7-42
8-50
9-04
10-14
10-28
11-39
13-02
13-16
14-37
14-54
16-07
16-17
17-27
17-43
18-55
19-12
20-26
20-42

/st---- вызов меню остановок
    
            `
            )
        })


        bot.action('data5', (ctx) => {
            ctx.reply(
            `
маршрут номер 10
график1            
Котовского
6-32
6-49
7-57
8-14
9-34
9-52
11-11
11-30
13-37
13-56
15-16
15-35
16-49
17-07
18-25
18-42
19-58
20-14


маршрут номер 10
график2
Котовского
7-25
7-44
8-46
9-06
10-12
10-30
11-37
13-00
13-18
14-35
14-56
16-05
16-18
17-25
17-45
18-53
19-14
20-24
20-44
/st---- вызов меню остановок
            `
            )
        })


    
        bot.action('data6', (ctx) => {
            ctx.reply(
            `
маршрут 10
график 2
Спортивная
6-30
6-51
7-55
8-16
9-32
9-54
11-09
11-32
13-35
13-58
15-14
15-37
16-47
17-09
18-23
18-44
19-56
20-16

маршрут 10
график 2
Спортивная
7-23
7-46
8-45
9-08
10-10
10-32
11-35
12-58
13-20
14-33
14-58
16-03
16-20
17-23
17-47
18-51
19-16
20-22
20-46
/st---- вызов меню остановок

            

            `
            )
        })


        bot.action('data7', (ctx) => {
            ctx.reply(
                `
маршрут 10
график1  
Баня
6-28
6-53
7-53
8-18
9-30
9-56
11-07
11-34
13-34
13-59
15-12
15-38
16-46
17-10
18-22
18-45
19-55
20-17

маршрут 10
график 2
Баня
7-21
7-48
8-44
9-10
10-08
10-34
11-33
12-56
13-22
14-31
14-59
16-02
16-21
17-22
17-48
18-50
19-18
20-20
20-48
/st---- вызов меню остановок
`
            )})

bot.action('data8', (ctx) => {
    ctx.reply(`
маршрут 10
график1                
Почта

7-01
7-47
8-25
9-23
10-04
10-59
11-41
13-26
14-07
15-04
15-46
16-38
17-18
18-14
18-53
19-48
20-25

маршрут 10
график 2
Почта
7-13
7-56
8-36
9-18
10-00
10-42
11-25

13-30
14-23
15-07
15-54
16-29
17-14
17-56
18-42
19-26
20-12
20-56

/st---- вызов меню остановок


`
            )
        })


        bot.action('data9', (ctx) => {
            ctx.reply(
            `
маршрут 10
график 1
ПлощадьРеволюции
6-25
6-58
7-50
8-22
9-25
10-01
11-02
11-38
13-29
14-04
15-07
15-43
16-41
17-15
18-17
18-50
19-51
20-22

маршрут 10
график 2
ПлощадьРеволюции
7-16
7-53
8-39
9-15
10-03
10-39
11-28
12-51
13-27
14-26
15-04
15-57
16-26
17-17
17-53
18-45
19-23
20-15
20-53

            `
         
                )})

                bot.action('data11', (ctx) => {
                    ctx.reply(
                 `
маршрут 10
график 2
ПочтаПочта

7-01
7-47
8-25
9-23
10-04
10-59
11-41
13-26
14-07
15-04
15-46
16-38
17-18
18-14
18-53
19-48
20-25

маршрут 10
график 2
Почта
7-13
7-56
8-36
9-18
10-00
10-42
11-25

13-30
14-23
15-07
15-54
16-29
17-14
17-56
18-42
19-26
20-12
20-56

                 `
                    )})


        bot.action('data11', (ctx) => {
            ctx.reply(
         
                `
 маршрут 10
график 1                
Вокзал
7-03
7-45
8-27
9-21
10-06
10-57
11-43
13-24
14-09
15-02
15-48
16-36
17-20
18-12
18-55
19-46
20-27

маршрут 10
график 2
Вокзал
7-11
7-58
8-34
9-20
9-58
10-44
11-23
13-32
14-21
15-09
15-52
16-31
17-12
17-58
18-40
19-28
20-10
20-58
/st---- вызов меню остановок
            `
            )
        })


        bot.action('data12', (ctx) => {
            ctx.reply(
            `

 маршрут 10
 график 2            
 Завод им.Калинина
7-05
7-43
8-29
9-19
10-08
10-55
11-45
13-22
14-11
15-00
15-50
16-34
17-22
18-10
18-57
19-44
20-29

маршрут 10
график 2
Завод им.Калинина
7-09
8-00
8-32
9-22
9-56
10-46
11-21

13-34
14-19
15-12
15-50
16-33
17-10
18-00
18-38
19-30
20-08
21-00

            

            /st---- вызов меню остановок
            `
            )
        })


        bot.action('data13', (ctx) => {
            ctx.reply(
            `
маршрут 10
график 2
Чкаловский
7-08
7-41
8-32
9-16
10-11
10-53
11-48
13-19
14-14
14-57
15-53
16-33
17-25
18-07
19-00
19-41
20-32

маршрут 10
график 2
Чкаловский
7-06
8-03
8-29
9-25
9-53
10-49
11-18

13-37
14-16
15-15
15-47
16-35
17-07
18-03
18-35
19-33
20-05
21-03


            /st---- вызов меню остановок
            `
            )
        })

        bot.action('data14', (ctx) => {
            ctx.reply(
            `
            маршрут 10
            график1
            Лесозавод
            7-10
            7-38
            8-34
            9-14
            10-13
            10-51
            11-50
            13-17
            14-16
            14-55
            15-54
            16-31
            17-27
            18-05
            19-02
            19-39
            20-34
            
            маршрут 10
            график 2
            Лесозавод
            7-04
            8-05
            8-27
            9-27
            9-51
            10-51
            11-16
            
            13-39
            14-14
            15-17
            15-45
            16-37
            17-05
            18-05
            18-33
            19-35
            20-03
            21-05
            

            /st---- вызов меню остановок
            `
            )
        })

        bot.action('data15', (ctx) => {
            ctx.reply(
            `
 маршрут 10
 график 1
СМУ – 5
7-12
7-36
8-36
9-12
10-15
10-49
11-52
13-15
14-18
14-53
15-56
16-29
17-29
18-03
19-04
19-37
20-36

маршрут 10
график 2
СМУ - 5
7-02
8-07
8-25
9-29
9-49
10-53
11-14

13-41
14-12
15-19
15-43
16-39
17-03
18-07
18-31
19-36
20-01
21-07


            /st---- вызов меню остановок
            `
            )
        })

        bot.action('data16', (ctx) => {
            ctx.reply(
            `
маршрут 10
график 1
Костромская
7-14
7-34
8-38
9-10
10-17
10-47
11-54
13-13
14-20
14-51
15-58
16-27
17-31
18-01
19-06
19-35
20-38

маршрут 10
график 2
Костромская
7-00
8-09
8-24
9-31
9-47
10-55
11-12

13-43
14-10
15-21
15-41
16-41
17-01
18-09
18-29
19-38
19-59
21-09


 /st---- вызов меню остановок
            `
            )
        })

        bot.action('data17', (ctx) => {
            ctx.reply(
            `
маршрут 10
график 1
Благоева

7-16
7-32
8-40
9-08
10-18
10-45
11-56
13-11
14-22
14-49
16-00
16-25
17-33
17-59
19-08
19-33
20-40

маршрут 10
график 2
Благоева
6-58
8-11
8-23
9-33
9-45
10-57
11-10

13-45
14-08
15-23
15-39
16-43
16-59
18-11
18-27
19-40
19-57
21-11


 /st---- вызов меню остановок
            `
            )
        })

        bot.action('data18', (ctx) => {
            ctx.reply(
            `
маршрут 10
график 1
Рынок
7-18
7-30
8-42
9-06
10-20
10-43
11-58
13-09
14-24
14-47
16-02
16-23
17-35
17-57
19-10
19-31
20-42

маршрут 10
график 2
Рынок
6-56
8-13
8-21
9-35
9-43
10-59
11-08

13-47
14-06
15-25
15-37
16-45
16-57
18-13
18-25
19-42
19-55
21-13
 /st---- вызов меню остановок
            `
            )
        })

        bot.action('data19', (ctx) => {
            ctx.reply(
            `
маршрут 10
график 2
 Щорса
7-19
7-29
8-44
9-05
10-21
10-41
11-59
13-08
14-25
14-46
16-03
16-22
17-36
17-55
19-11
19-30
20-43

маршрут 10
график 2
Щорса
6-55
8-14
8-20
9-36
9-42
11-00
11-07

13-48
14-04
15-26
15-35
16-47
16-55
18-14
18-23
19-44
19-54
21-15
/st---- вызов меню остановок
            `
            )
        })

        bot.action('data20', (ctx) => {
            ctx.reply(
   
       `
маршрут 10
график 2  
 Сосновый бор
7-28
9-03
10-39
13-06
14-44
16-20
17-54
19-28

маршрут 10
график 2
Сосновый бор
6-53
8-19
9-41
11-06
14-03
15-33
16-53
18-21
19-53



            /st---- вызов меню остановок
            `
            )
        })

        bot.action('data21', (ctx) => {
            ctx.reply(
            `
маршрут 10
график 1
Рубинского
7-27
9-01
10-37
13-04
14-42
16-18
17-52
19-26


маршрут 10
график 2
Рубинского
6-52
8-18
9-40
11-05
14-02
15-32
16-52
18-20
19-52
 /st---- вызов меню остановок
            `
            )
        })

        bot.action('data22', (ctx) => {
            ctx.reply(
            `

маршрут 10
 график 1    
 Коммунальная
7-26
8-59
10-35
13-02
14-40
16-16
17-50
19-24


маршрут 10
график 2
Коммунальная
6-51
8-17
9-39
11-04
14-01
15-31
16-51
18-19
19-51

 /st---- вызов меню остановок
            `
            )
        })

        bot.action('data23', (ctx) => {
            ctx.reply(
            `

маршрут 10
график 1
 Грузинская
7-23
7-24
8-52
8-57
10-29
10-33
12-07
13-00
14-33
14-38
16-10
16-14
17-43
17-48
19-18
19-22
20-50

маршрут 10
график 2
Грузинская
6-50
8-15
8-16
9-37
9-38
11-01
11-03

13-50
14-00
15-28
15-30
16-49
16-50
18-16
18-18
19-46
19-50
21-17


            /st---- вызов меню остановок
            `
            )
        })













bot.launch();

// Enable graceful stop
process.once('SIGINT', () => bot.stop('SIGINT'));
process.once('SIGTERM', () => bot.stop('SIGTERM'));